Repository: silvarbor/prowl
Catalog: App/Sources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Uses the behavior declared in the workflow file.
zh_hans: 使用工作流文件中声明的行为。

source: Uses the pane that starts the workflow and its detected agent.
zh_hans: 使用启动工作流的窗格及其中检测到的 Agent。

source: Uses the pane that starts this workflow.
zh_hans: 使用启动此工作流的窗格。

source: Uses the workflow file's setting, which reviews choices before running.
zh_hans: 使用工作流文件中的设置：运行前先审阅各项选择。

source: Uses the workflow file's setting, which runs directly when all required choices can be resolved.
zh_hans: 使用工作流文件中的设置：所有必需的选择都能确定时直接运行。

source: Uses this project's README to propose fitting symbols. Everything runs on-device.
zh_hans: 使用此项目的 README 推荐合适的符号。全部在设备端运行。

source: Uses your chosen color everywhere, regardless of per-repository colors.
zh_hans: 在所有位置使用你选择的颜色，不受各仓库颜色影响。

source: Validation
zh_hans: 验证

source: Variable name
zh_hans: 变量名

source: Variable value
zh_hans: 变量值

source: Version %@ has been downloaded. Click to relaunch and install.
zh_hans: 版本 %@ 已下载。点击即可重新启动并安装。

source: Version %@ is available. Click to review and install.
zh_hans: 版本 %@ 可用。点击即可查看并安装。

source: View Archived Worktrees
zh_hans: 查看已归档 worktree

source: View Prowl starts in on launch. Shelf and Canvas require at least one worktree or folder.
zh_hans: 启动时 Prowl 进入的视图。书架和画布需要至少一个 worktree 或文件夹。

source: View release notes
zh_hans: 查看发行说明

source: Warming up shells
zh_hans: 正在给 shell 预热

source: Warning
zh_hans: 警告

source: What should the Agent do?
zh_hans: Agent 应该做什么？

source: What the run does, in order. Hover a step for details.
zh_hans: 此次运行按顺序执行的内容。悬停在步骤上可查看详情。

source: What this workspace is for, in a few words
zh_hans: 用几个词说明这个工作区的用途

source: When a new version is available, a small badge appears next to the notifications bell. Click it to review, install, and choose future background downloads.
zh_hans: 有新版本可用时，通知铃铛旁会出现一个小标记。点击它即可查看、安装，并选择以后是否在后台下载。

source: When a pull request is merged
zh_hans: 当拉取请求被合并时

source: When disabled, all Shelf spines use the selected Gray or System Tint style.
zh_hans: 关闭时，所有书架书脊均使用所选的灰色或系统色调样式。

source: When enabled, Prowl attempts to restore tabs and splits after restart.
zh_hans: 开启时，Prowl 会在重启后尝试恢复标签页和分屏。

source: When enabled, you choose the branch name and where it branches from before creating the worktree.
zh_hans: 开启时，你可以在创建 worktree 之前选择分支名称以及分支的起点。

source: Where does the repository come from?
zh_hans: 仓库来自哪里？

source: Which of this Mac’s addresses accept connections
zh_hans: 这台 Mac 的哪些地址接受连接

source: Who takes part in this run. Hover a role for what it does.
zh_hans: 参与此次运行的角色。悬停在角色上可查看其作用。

source: Window Tint
zh_hans: 窗口色调

source: With external monitors connected, follows the monitor containing Prowl's main window.
zh_hans: 连接了外接显示器时，跟随 Prowl 主窗口所在的显示器。

source: Workflow
zh_hans: 工作流

source: Workflow History
zh_hans: 工作流历史

source: Workflow History. Hover to preview or click to keep open.
zh_hans: 工作流历史。悬停可预览，点击可保持打开。

source: Workflow Icon
zh_hans: 工作流图标

source: Workflow Unavailable
zh_hans: 工作流不可用

source: Workflow completed in %@.
zh_hans: 工作流已在 %@ 中完成。

source: Workflow created at %@
zh_hans: 工作流已创建于 %@

source: Workflow finished: %@%@
zh_hans: 工作流已结束：%@%@

source: Workflow icon
zh_hans: 工作流图标

source: Workflow needs attention: %@%@
zh_hans: 工作流需要处理：%@%@

source: Workflow run options
zh_hans: 工作流运行选项

source: Workflow running: %@%@
zh_hans: 工作流运行中：%@%@

source: Workflow runtime is not available.
zh_hans: 工作流运行时不可用。

source: Workflow settings are not available yet.
zh_hans: 工作流设置尚不可用。

source: Workflow status
zh_hans: 工作流状态

source: Workflow status. Hover to preview or click to keep the run panel open.
zh_hans: 工作流状态。悬停可预览，点击可保持运行面板打开。

source: Workflow · %@
zh_hans: 工作流 · %@

source: Workflows
zh_hans: 工作流

source: Workflows Error
zh_hans: 工作流错误

source: Workflows coordinate agents for repeatable tasks. Select one to review its setup or run it.
zh_hans: 工作流可协调 Agent 完成可重复的任务。选择一个即可查看其设置或运行它。

source: Workflows need the prowl command line tool.
zh_hans: 工作流需要 prowl 命令行工具。

source: Working directory is clean
zh_hans: 工作目录是干净的

source: Working stays compact. Blocked and Done appear as stronger agent notifications.
zh_hans: “工作中”保持紧凑。“需处理”和“已完成”会以更醒目的 Agent 通知形式出现。

source: Workspace
zh_hans: 工作区

source: Workspace created
zh_hans: 工作区已创建

source: Workspace creation canceled
zh_hans: 已取消创建工作区

source: Workspace folder required.
zh_hans: 需要指定工作区文件夹。

source: Workspace saved
zh_hans: 工作区已保存

source: Workspace title required.
zh_hans: 需要填写工作区标题。

source: Worktree Toolbar
zh_hans: worktree 工具栏

source: Worktree creation finished without a result.
zh_hans: worktree 创建已结束，但没有得到结果。

source: Worktree name
zh_hans: worktree 名称

source: Worktree name can't contain slashes.
zh_hans: worktree 名称不能包含斜杠。

source: Worktree name is invalid.
zh_hans: worktree 名称无效。

source: Worktree on %@ from %@
zh_hans: 来自 %2$@ 的 %1$@ 分支 worktree

source: Worktrees
zh_hans: Worktree

source: Write the starter bundle and open it in your default YAML editor (Return)
zh_hans: 写入起始 Bundle，并在默认 YAML 编辑器中打开（Return）

source: Yellow
zh_hans: 黄色

source: Yes
zh_hans: 是

source: Your Workflows
zh_hans: 你的工作流

source: Zoom Split
zh_hans: 缩放分屏

source: Zoom in/out
zh_hans: 放大/缩小

source: Zoom split
zh_hans: 缩放分屏

source: [Debug] Light Dock Notification Dot
zh_hans: [调试] 浅色程序坞通知点

source: [Debug] Simulate Update Found
zh_hans: [调试] 模拟发现更新

source: [Debug] Toast: In Progress
zh_hans: [调试] Toast：进行中

source: [Debug] Toast: Success
zh_hans: [调试] Toast：成功

source: a Git repository or any folder — opens one project root
zh_hans: Git 仓库或任意文件夹——打开一个项目根目录

source: a command that has been running for at least 10 seconds
zh_hans: 已运行至少 10 秒的命令

source: a role
zh_hans: 某个角色

source: active agent work or an unseen agent result
zh_hans: 进行中的 Agent 工作或未查看的 Agent 结果

source: active agent work, unseen agent results, or long-running commands
zh_hans: 进行中的 Agent 工作、未查看的 Agent 结果或长时间运行的命令

source: address already in use.
zh_hans: 地址已被占用。

source: address not available.
zh_hans: 地址不可用。

source: address not resolved.
zh_hans: 地址无法解析。

source: adds %lld
zh_hans: 新增 %lld 个

source: adds 1
zh_hans: 新增 1 个

# agentState.blocked
source: Blocked
zh_hans: 需处理

# agentState.done
source: Done
zh_hans: 已完成

# agentState.idle
source: Idle
zh_hans: 空闲

# agentState.working
source: Working
zh_hans: 工作中

source: bottom
zh_hans: 下方

source: commit
zh_hans: 个提交

source: commits
zh_hans: 个提交

source: connection refused.
zh_hans: 连接被拒绝。

source: copying %lld untracked files
zh_hans: 正在复制 %lld 个未跟踪的文件

source: default branch
zh_hans: 默认分支

source: from
zh_hans: 基于

source: gh could not verify this account in time.
zh_hans: gh 未能及时验证此账户。

source: gh could not verify this account.
zh_hans: gh 无法验证此账户。

source: gh reported an authentication issue.
zh_hans: gh 报告了身份验证问题。

source: in %@
zh_hans: 在 %@ 中

source: in the source repository
zh_hans: （位于源仓库）

source: launch
zh_hans: 新角色

source: left
zh_hans: 左侧

source: macOS could not register this shortcut globally. Choose another shortcut.
zh_hans: macOS 无法将此快捷键注册为全局快捷键。请选择其他快捷键。

source: main branch
zh_hans: 主分支

source: model %@
zh_hans: 模型 %@

source: network unreachable.
zh_hans: 网络不可达。

source: notification
zh_hans: 通知

source: output
zh_hans: 输出

source: pane
zh_hans: 窗格

source: panes
zh_hans: 窗格

source: prompt
zh_hans: 提示词

source: prowl command line tool removed
zh_hans: prowl 命令行工具已移除

source: prowl installed at %@
zh_hans: prowl 已安装到 %@

source: prowl reaches the running app through this local Unix socket. Set PROWL_CLI_SOCKET for both Prowl and prowl to use a different path.
zh_hans: prowl 通过这个本地 Unix 套接字与运行中的应用通信。要使用其他路径，请为 Prowl 和 prowl 同时设置 PROWL_CLI_SOCKET。

source: pull request base
zh_hans: 拉取请求的基准

source: recent input
zh_hans: 最近的输入

source: removes %lld
zh_hans: 移除 %lld 个

source: removes 1
zh_hans: 移除 1 个

source: right
zh_hans: 右侧

source: role
zh_hans: 该角色

source: seconds
zh_hans: 秒

source: timed out.
zh_hans: 已超时。

source: top
zh_hans: 上方

source: value
zh_hans: 值

source: vs %@ · %@
zh_hans: 对比 %@ · %@

source: worktree base setting
zh_hans: worktree 基准设置

source: ~%@ left
zh_hans: 剩余约 %@

source: “%@” (%@) will be moved to Trash. You can restore it in Finder.
zh_hans: “%@”（%@）将移至废纸篓。你可以在访达中恢复它。

source: “%@” and “%@” both use %@. Choose Replace to keep the new binding and disable the conflicting one.
zh_hans: “%@”和“%@”都使用 %@。 选择“替换”可保留新的绑定，并停用冲突的绑定。

source: “%@” and “%@” both use %@. Choose Replace to keep the new shortcut and clear the conflicting command.
zh_hans: “%@”和“%@”都使用 %@。 选择“替换”可保留新的快捷键，并清除冲突命令的快捷键。

source: “%@” is used by the %@ custom command “%@”. Choose another shortcut.
zh_hans: “%1$@”已被%2$@自定义命令“%3$@”使用。请选择其他快捷键。

source: “%@” launched without managed signals. %@
zh_hans: “%@”已启动，但未启用受管理的信号。%@

source: “Remove Profile” keeps the profile folder on disk; “Remove and Trash Files” moves it to the Trash.
zh_hans: “移除配置”会在磁盘上保留配置文件夹；“移除并移入废纸篓”会将其移至废纸篓。

source: ⌘ + scroll, or pinch gesture
zh_hans: ⌘ + 滚动，或双指开合
